[{"UID":"1","abstract":"The objective of this workshop is to provide an open forum for discussing social challenges for the AKBC community, and to explore the question: Which aspects of the social context influence automated knowledge base construction, and how?\n\n\n\nKnowledge by its very nature adds social components and context to underlying data. Even automated methods operate in a social context--social processes influence all aspects of AKBC systems from design to end use. All data are socially shaped and there is far more entanglement between automated methods and social issues than a first glance understanding of automation might suggest. \n\n\n\nThis workshop will provide a forum for AKBC attendees to explore these issues along with individuals with expertise and experience in related areas--in order to explore the landscape, understand key concepts and known results in this area, and engender a discussion towards the cutting-edge of research formulations. \n\n\n\nGiven that this is a new area of multidisciplinary, convergence research, the workshop is open to receiving position papers, narratives, and examples of failures as well as successes.\n\n","authors":"Chaitanya Baru|Geof Bowker|David Ribes|Sam Klein","title":"Workshop on Social Aspects of Automated Knowledge Base Construction","website_url":"https://sites.google.com/view/socialakbc/home"},{"UID":"2","abstract":"The structure of the relationships between entities in finance and economics is inherently a dynamically-changing network, and knowledge graphs are a natural choice for representing and storing information of such networks. As knowledge graphs of the financial economy encompasses not only information extracted and abstracted from large amounts of textual data, but also from numerical and time series data, this field emerges as cross-pollination between NLP, quantitative finance and economics. \n\nCurrently, most finance/economic literature focuses on quantitative data as modern NLP techniques are still recent developments. Relation extraction from non-financial data allows to uncover relationships amongst companies that are not immediately apparent from the price signal or official financial documents. Previous research at the intersection of KGs and finance has primarily focused on stock price prediction and financial fraud detection. In the field of NLP, KG construction has been an active field for many years, but the application and focus on finance and economics is only emerging. Most existing large-scale knowledge graphs are bootstrapped from Wikipedia, which only has entries for a fraction of existing companies, so novel knowledge graph bootstrapping techniques need to be developed. \n\nThe aim of this workshop is to bring researchers from both industry and academia to bridge the gap between semantic and symbolic information and numerical information in knowledge graphs, and to discuss the application of KGs in finance and economics. Using automated methods to build knowledge graphs that are dynamic, nuanced and large scale allows researchers to learn from advances from several fields and enables the financial and economics industry to draw new insights and make more informed and timely decisions. ","authors":"Caitlin Walsh|Nathan Burton|Garrett Conway|Migael Strydom|Ye Tian","title":"Knowledge Graphs for Finance and Economics","website_url":"https://finance-at-akbc.bubbleapps.io/"},{"UID":"3","abstract":"Knowledge extraction (KE) was mainly driven by task-specific human annotations. Recent years have seen an increasing interest in KE with WISE supervision (Weak supervision, Indirect supervision, SElf-supervision, etc.). This workshop aims to provide a forum for researchers and practitioners from broad communities, such as information extraction (IE), knowledge graphs (KG), semantic web, and transfer learning, etc., to discuss the challenges and promises of KE when human annotations are limited.\n\nWise-Supervision 2022 aims to bring together researchers from different areas related to KE. As such, the workshop welcomes and covers a wide range of topics, including (non-exclusively):\n\nIE/KE with indirect supervision from textual entailment, summarization, etc.\nIE/KE with weak supervision and denoising.\nIE/KE with self-supervision, e.g., pretrained LMs for IE/KE.\nKG construction and consolidation.\nLow-resource IE/KE.\nKE in industry settings.","authors":"Wenpeng Yin|Muhao Chen|Lifu Huang|Huan Sun|Hongming Zhang|Benjamin Roth|Barbara Plank","title":"Weak, Indirect and Self Supervision for Knowledge Extraction (WISE Supervision)","website_url":"https://wise-supervision.github.io/"}]
